
#   ██████                               ████ ██  ██
#  ░█░░░░██                             ░██░ ░░  ░██
#  ░█   ░██  ██████  █████  ███     ██ ██████ ██ ░██  █████
#  ░██████  ░░██░░█ ██░░░██░░██  █ ░██░░░██░ ░██ ░██ ██░░░██
#  ░█░░░░ ██ ░██ ░ ░███████ ░██ ███░██  ░██  ░██ ░██░███████
#  ░█    ░██ ░██   ░██░░░░  ░████░████  ░██  ░██ ░██░██░░░░
#  ░███████ ░███   ░░██████ ███░ ░░░██  ░██  ░██ ███░░██████
#  ░░░░░░░  ░░░     ░░░░░░ ░░░    ░░░   ░░   ░░ ░░░  ░░░░░░

tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/autoupdate"
tap "homebrew/services"
tap "buo/cask-upgrade"
brew "mas"

cask_args appdir: "/Applications"

# Install some tools.
brew "moreutils"
brew "findutils"
brew "gnupg"
brew "cmake"

# Install more recent versions of some macOS tools.
brew "grep"
brew "openssh"
brew "screen"
brew "php"
brew "gmp"

# Install font tools.
tap "bramstein/webfonttools"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"

# Install some CTF tools; see https://github.com/ctfs/write-ups.
brew "aircrack-ng"
brew "bfg"
brew "binutils"
brew "binwalk"
brew "cifer"
brew "dex2jar"
brew "dns2tcp"
brew "fcrackzip"
brew "foremost"
brew "hashpump"
brew "hydra"
brew "john"
brew "netpbm"
brew "nmap"
brew "pngcheck"
brew "socat"
brew "sqlmap"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "ucspi-tcp"
brew "xpdf"
brew "xz"

# Install other useful binaries.
brew "ack"
#brew "exiv2"
brew "git"
brew "git-lfs"
brew "git-delta"
brew "git-extras"
brew "gh"
brew "hub"
brew "gist"
brew "lua"
brew "luarocks"
brew "p7zip"
brew "pigz"
brew "pv"
brew "rename"
brew "rlwrap"
brew "ssh-copy-id"
brew "tree"
brew "vbindiff"
brew "zopfli"
brew "nano"
brew "bat"
brew "exa"
brew "fzf"
brew "blueutil"
brew "minicom"
brew "ffmpeg"
brew "qemu"
brew "youtube-dl"
brew "fd"
brew "grip"
brew "pandoc"
brew "topgrade"
brew "webp"
brew "openssl"
brew "wifi-password"
brew "graphicsmagick"
brew "arduino-cli"
brew "task"
brew "watch"
brew "switchaudio-osx"
brew "sphinx-doc"
brew "readline"
brew "nnn"
brew "memtester"
brew "hstr"
brew "gotop"
brew "stow"
brew "oath-toolkit"
brew "chroma"
brew "catimg"
brew "thefuck"
brew "tmux"
brew "toilet"
brew "onefetch"
brew "sqlite"
brew "zlib"
brew "tldr"
brew "neofetch"
